test/simpleTest/0.orig/A

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      A;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 -1 0];

internalField   uniform (0 0 0);

boundaryField
{
    "outlet.*"
    {
        type            fixedValue;
        value   uniform (0 0 0);
    }

    "electrod.*"
    {
        type            zeroGradient;
    }

    "(front|back)"
    {
        type            wedge;
    }

    axis
    {
        type empty;
    }
}


// ************************************************************************* //
