test/simpleTest/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          300;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    "outlet.*"
    {
        //type            zeroGradient;
        type            fixedValue;
        value   uniform $Tinlet;
    }
    
    /*"outletSides.*"
    {
        type            fixedValue;
        value   uniform $Tinlet;
    }*/

    "electrodSide.*"
    {
        type            zeroGradient;
    }
   
    
    "electrodFace.*"
    {
        type            zeroGradient;    
    }

    /*"electrodFaceTop"
    {
        type fixedGradient;
        gradient   uniform 5e6;
    }

    "electrodFaceBot"
    {
        type fixedGradient;
        gradient   uniform 5e6;
    }
    */

    "(front|back)"
    {
        type            wedge;
    }

    axis
    {
        type empty;
    }
    
    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
