test/simpleTest/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (0 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    "outlet.*"
    {   
        //type            inletOutlet;
        //inletValue      uniform $Uinlet;
        //value           uniform $Uinlet;
        type            zeroGradient;
    }

    "electrod.*"
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            wedge;
    }

    axis
    {
        type empty;
    }
    
    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
