test/simpleTest/0.orig/source

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      source;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * /


dimensions      [1 -1 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "outlet.*"
    {   
        type            calculated;
        value           uniform 0;
    }

    "electrod.*"
    {
        type            calculated;
        value           uniform 0;
    }

    "(front|back)"
    {
        type            wedge;
    }

    axis
    {
        type empty;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
