test/simpleTest/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

domain
{
    //dimensions
    H 2e-3;
    Rin     5e-4;
    Rout    #eval"10*$H";
    Dbot    #eval"-0.5*$H";
    Dup     #eval"0.5*$H";
    Hbot    #eval"$Dbot -10*$H";
    Hup     #eval"$Dbot +10*$H";

    width   1e-3;

    // Number of cells
    RinCells  24;//9; 
    DCells    120;//30;
    HCells    240;//300; 
    RoutCells 220;//260; 
    
    //gradings
    Dgrading    3;
    RoutGrading 30;
    Hgrading    20;
}


vertices
(
    (0 0 $:domain.Dbot)
    ($:domain.Rin 0 $:domain.Dbot)
    ($:domain.Rin 0 $:domain.Dup)
    (0 0 $:domain.Dup)
    
    (0 $:domain.width $:domain.Dbot)
    ($:domain.Rin $:domain.width $:domain.Dbot)
    ($:domain.Rin $:domain.width $:domain.Dup)
    (0 $:domain.width $:domain.Dup)

    ($:domain.Rin 0 $:domain.Hbot)
    ($:domain.Rout 0 $:domain.Hbot)
    ($:domain.Rout 0 $:domain.Hup)
    ($:domain.Rin 0 $:domain.Hup)
  
    ($:domain.Rin $:domain.width $:domain.Hbot)
    ($:domain.Rout $:domain.width $:domain.Hbot)
    ($:domain.Rout $:domain.width $:domain.Hup)
    ($:domain.Rin $:domain.width $:domain.Hup)

    ($:domain.Rout 0 $:domain.Dbot)
    ($:domain.Rout $:domain.width $:domain.Dbot)

    ($:domain.Rout 0 $:domain.Dup)
    ($:domain.Rout $:domain.width $:domain.Dup)
);

blocks
(
    hex (0 1 5 4 3 2 6 7)
    ($:domain.RinCells 1 $:domain.DCells)
    simpleGrading 
    (
        1
        1
        (
            (0.5 0.5 $:domain.Dgrading)
            (0.5 0.5 #eval"1/$:domain.Dgrading")
        )
    )
   
    hex (8 9 13 12 1 16 17 5)
    ($:domain.RoutCells 1 $:domain.HCells)
    simpleGrading 
    (   
        $:domain.RoutGrading
        1 
        #eval"1/$:domain.Hgrading"
    )

    hex (1 16 17 5 2 18 19 6)
    ($:domain.RoutCells 1 $:domain.DCells)
    simpleGrading
    (
        $:domain.RoutGrading
        1
        (
            (0.5 0.5 $:domain.Dgrading)
            (0.5 0.5 #eval"1/$:domain.Dgrading")
        )
    )

    hex (2 18 19 6 11 10 14 15)
    ($:domain.RoutCells 1 $:domain.HCells)
    simpleGrading
    (   
        $:domain.RoutGrading
        1 
        $:domain.Hgrading
    )

);


edges
(
);


boundary
(
    axis
    {
        type empty;
        faces
        (
            (3 7 4 0)
        );    
    }

    electrodFaceBot
    {
        type wall;
        faces
        (
            (4 5 1 0)
        );
    }

    electrodFaceTop
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }

    electrodSidesBot
    {
        type wall;
        faces
        (
            (1 5 8 12)
    
        );
    }
    
    electrodSidesTop
    {
        type wall;
        faces
        ( 
            (11 15 6 2)
        );
    }
    
    outletSidesTop
    {
        type patch;
        faces
        (
            (11 10 14 15)
        );
    }
     
    outletSidesBot
    {
        type patch;
        faces
        (
            (12 13 9 8)
        );
    }   
    outlet
    {
        type patch;
        faces
        (
            (14 10 18 19)
            (18 19 17 16)
            (16 17 13 9)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (8 9 16 1)
            (1 16 18 2)
            (2 18 10 11)
        );
    }

    back
    {
        type empty;
        faces
        (
            (7 6 5 4)
            (5 17 13 12)
            (6 19 17 5)
            (15 14 19 6)
        );
    }

);

// ************************************************************************* //
