test/simpleTest/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        //solver          PBiCGStab;
        //preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(rho|U|k|omega|e|h|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    V
    {   
        solver          GAMG;
        //smoother        GaussSeidel;
        //solver          smoothSolver;//PBiCGStab;
        smoother        DICGaussSeidel;//GaussSeidel;
        //preconditioner  DIC;
        tolerance       1e-14;
        relTol          0.001;
    }

    "(rho|U|k|omega|e|h|nuTilda)Final"
    {
        $U;
        relTol          0;
    }

    VFinal
    {
        $V;
        relTol          0;
    }
}


PIMPLE
{
    momentumPredictor yes;
    consistent      yes;
    transonic       yes;
    SIMPLErho       false;//on; //on doesn't solve continuity eq // con false e 1 outer loop nessuna fluttuazione
    nCorrectors              3;
    nNonOrthogonalCorrectors 0;
// at least 2 outer loop to correct sigma and use the real value after updated T 
//aggiungi schema loop pimple algorithm
    nOuterCorrectors         1;
    //pMinFactor      0.1;
    //pMaxFactor      6;
    /*outerCorrectorResidualControl
    {
        ".*"
        {
            relTol 1e-2;
            tolerance 2e-3;
        }
    }*/
}

relaxationFactors
{
    fields
    {
        ".*"     1; //set to 1= no relaxation (for transient simulations)
    }
    equations
    {
        ".*"     1;
    }
}

// ************************************************************************* //
