test/simpleTest/system/minMaxMagnitude
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2212
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the minimum and maximum values, by magnitude for non-scalar
    fields, and the locations where they occur.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/minMax/fieldMinMax.cfg"

fields ( T);

// ************************************************************************* //
